Revit 2024 API
Floor.GetNormalAtVerticalProjectionPoint Method
 Return a surface normal on either the top or bottom face of a floor slab at a point corresponding to the vertical projection of an arbitrary point in project space.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public XYZ GetNormalAtVerticalProjectionPoint(
	XYZ modelLocation,
	FloorFace floorFace
)
Visual Basic
Public Function GetNormalAtVerticalProjectionPoint ( _
	modelLocation As XYZ, _
	floorFace As FloorFace _
) As XYZ
Visual C++
public:
XYZ^ GetNormalAtVerticalProjectionPoint(
	XYZ^ modelLocation,
	FloorFace floorFace
)
Parameters
modelLocation
Type: Autodesk.Revit.DB.XYZ
 A point in project coordinates whose vertical projection will determine the location at which the normal will be taken.
floorFace
Type: Autodesk.Revit.DB.FloorFace
 A flag determining whether the top or bottom face of the floor should be used.
Return Value
 Normal vector on the slab at the projection point.
Remarks
 If the floor is shape edited, the floor location at which we attempt to take the normal must be within the boundaries of a face on the slab. Otherwise the method will return null.
See Also
Floor Class
Autodesk.Revit.DB Namespace